In [1]:
# Importando pandas e os arquivos
import pandas as pd
df = pd.read_csv("bank.csv", encoding = "UTF-8", sep = ";")

In [8]:
# Funções de agrupamento
df[df.marital == "married"].age.mean()

43.45441544511977

In [10]:
# usando groupby
df[["marital", "education", "age"]].groupby(["marital", "education"]).mean()

                          age
marital  education
divorced primary    51.392405
         secondary  43.496296
         tertiary   45.148387
         unknown    50.375000
married  primary    47.511407
         secondary  42.404345
         tertiary   41.777166
         unknown    48.444444
single   primary    37.013699
         secondary  33.052545
         tertiary   34.512821
         unknown    34.652174

In [20]:
# Média do balanço de pessoas com idade entre 30 e 50 anos, casadas e separadas
colunas = ["balance", "marital"]
df[((df.age >= 30) & (df.age <= 50)) & (df.marital.isin(["married", "divorced"]))][colunas].groupby(["marital"]).mean()

              balance
marital
divorced   910.406877
married   1388.499231

In [2]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no